app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Zygmunt"], ["last_name", "Bauman"], ["created_at", "2021-03-08 03:09:13.649420"], ["updated_at", "2021-03-08 03:09:13.649420"]]
---
    def create
        @author = Author.create!(author_params)

UPDATE "authors" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "Teste"], ["last_name", "Bauman"], ["updated_at", "2021-03-08 03:12:28.023143"], ["id", 1]]
---
    def update
        @author.update(author_params)