app/controllers/books_controller.rb

    def create
        @author.books.create!(book_params)
---
INSERT INTO "books" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        @book.update(book_params)
---
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "Teste"], ["updated_at", "2021-03-09 03:00:10.326410"], ["id", 1]]

    def set_author
        @author= Author.find(params[:author_id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_book
        @book= @author.books.find_by!(id: params[:id]) if @author
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ? AND "books"."id" = ? LIMIT ?  [["author_id", 1], ["id", 1], ["LIMIT", 1]]